app/controllers/evaluaciones_controller.rb

INSERT INTO "evaluaciones" ("turno_id", "pregunta1", "resultado1", "pregunta2", "resultado2", "pregunta3", "resultado3", "pregunta4", "resultado4", "comentario", "resultado_total", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
  def create
    @evaluacion = Evaluacion.new(evaluacion_params)

    respond_to do |format|
      if @evaluacion.save