app/controllers/logins_controller.rb

SELECT "logins".* FROM "logins"
---
  def index
    @logins = Login.all

INSERT INTO "logins" ("estado", "sesion", "clase_usuario", "usuario_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["estado", 3], ["sesion", "123"], ["clase_usuario", 3], ["usuario_id", 0], ["created_at", "2016-01-20 03:02:07.216770"], ["updated_at", "2016-01-20 03:02:07.216770"]]
---
  def create
    @login = Login.new(login_params)

    respond_to do |format|
      if @login.save

SELECT  "logins".* FROM "logins" WHERE "logins"."id" = $1 LIMIT 1  [["id", 6]]
---
    def set_login
      @login = Login.find(params[:id])