app/controllers/turnos_controller.rb

SELECT "turnos".* FROM "turnos"
---
  def index
    @turnos = Turno.all

INSERT INTO "turnos" ("nombre", "resumen", "descripcion", "usuario_id", "comentario_atencion", "estado", "agencia_id", "hora_ingreso", "hora_atencion", "hora_finalizacion", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def create
    @turno = Turno.new(turno_params)

    respond_to do |format|
      if @turno.save

UPDATE "turnos" SET "usuario_id" = $1, "agencia_id" = $2, "updated_at" = $3 WHERE "turnos"."id" = $4  [["usuario_id", 7], ["agencia_id", 1], ["updated_at", "2016-01-24 22:14:56.370846"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @turno.update(turno_params)

SELECT  "turnos".* FROM "turnos" WHERE "turnos"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_turno
      @turno = Turno.find(params[:id])