app/controllers/usuarios_controller.rb

INSERT INTO "usuarios" ("nombre", "apellido", "correo", "login", "estado", "password_digest", "agencia_id", "rol", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @usuario = Usuario.new(usuario_params)

    respond_to do |format|
      if @usuario.save