app/views/turnos/_form.html.erb

        <%= f.label :usuario_id %><br>
        <%= f.collection_select :usuario_id, Usuario.all, :id, :login, class: 'form-control' %>
---
SELECT "usuarios".* FROM "usuarios"

        <%= f.label :agencia_id %><br>
        <%= f.collection_select :agencia_id, Agencia.all, :id, :nombre, class: 'form-control' %>
---
SELECT "agencias".* FROM "agencias"